[
  "recent-files-obsidian",
  "float-search",
  "settings-search",
  "obsidian-git",
  "easy-typing-obsidian",
  "better-word-count",
  "obsidian-image-auto-upload-plugin",
  "obsidian-hider",
  "obsidian42-brat",
  "obsidian-style-settings",
  "obsidian-image-toolkit",
  "reveal-active-file-button",
  "cm-chs-patch",
  "remember-cursor-position",
  "table-editor-obsidian"
]