[
  "recent-files-obsidian",
  "settings-search",
  "obsidian-git",
  "easy-typing-obsidian",
  "better-word-count",
  "obsidian-hider",
  "obsidian42-brat",
  "reveal-active-file-button",
  "table-editor-obsidian",
  "obsidian-folder-focus-mode",
  "code-styler",
  "float-search",
  "obsidian-image-auto-upload-plugin",
  "enhanced-image"
]