[
  "recent-files-obsidian",
  "obsidian-pangu",
  "float-search",
  "settings-search",
  "obsidian-git",
  "easy-typing-obsidian",
  "better-word-count",
  "obsidian-image-auto-upload-plugin",
  "obsidian-hider",
  "obsidian42-brat",
  "Enhanced editing",
  "obsidian-style-settings",
  "cmdr",
  "obsidian-linter",
  "obsidian-image-toolkit",
  "reveal-active-file-button",
  "obsidian-reveal-active-file"
]